Re_10/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
400
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<vector> 
20
(
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
(0 -0 -400)
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type            calculated;
        value           nonuniform List<vector> 
60
(
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
}


// ************************************************************************* //
